In [1]:
# Module used to connect Python with MongoDb
import pymongo
import pandas as pd
import pandas as pd
from sqlalchemy import create_engine
from config import password

In [2]:
# The default port used by MongoDB is 27017
# https://docs.mongodb.com/manual/reference/default-mongodb-port/
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)

# Define the 'classDB' database in Mongo
db = client.quote_db

In [3]:
# creating columns for the dataframe
quote = db.quote.find()
columns = ['name', 'born', 'description']
#create dataframe
author_df = pd.DataFrame(columns = columns)

for author in quote:
    
    #appending the data
    author_df = author_df.append({
                  'name'   : author['author']
                , 'born'  : author['born']
                , 'description' : author['author_description']}, ignore_index = True)
    
author_df = author_df.drop_duplicates()
author_df.reset_index(inplace = True, drop=True)
author_df.index += 1
author_df.head()

,name,born,description
1,Albert Einstein,"March 14, 1879 in Ulm, Germany","In 1879, Albert Einstein was born in U..."
2,J.K. Rowling,"July 31, 1965 in Yate, South Gloucestershire, ...",See also: Robert GalbraithAlthough she...
3,Jane Austen,"December 16, 1775 in Steventon Rectory, Hampsh...",Jane Austen was an English novelist wh...
4,Marilyn Monroe,"June 01, 1926 in The United States",Marilyn Monroe (born Norma Jeane Morte...
5,André Gide,"November 22, 1869 in Paris, France",André Paul Guillaume Gide was a French...

In [4]:
quote = db.quote.find()

# creating columns for the dataframe
columns = ['author', 'quote']
#create dataframe
quote_df = pd.DataFrame(columns = columns)
for q in quote:
        #appending the data
    quote_df = quote_df.append({
                  'author' : q['author'], 
                  'quote'  : q['quote']}, ignore_index = True)
quote_df.head()

            author                                              quote
0  Albert Einstein  “The world as we have created it is a process ...
1     J.K. Rowling  “It is our choices, Harry, that show what we t...
2  Albert Einstein  “There are only two ways to live your life. On...
3      Jane Austen  “The person, be it gentleman or lady, who has ...
4   Marilyn Monroe  “Imperfection is beauty, madness is genius and...

In [5]:
quote = list(db.quote.find())
tag_df = pd.DataFrame(quote)
tag_df = tag_df.explode('tag_list')
tag_df = pd.DataFrame(tag_df[["quote", "tag_list"]])
tag_df = tag_df[tag_df['tag_list']!='']

In [6]:
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/quote_db')
connection = engine.connect()

In [7]:
engine.table_names()

['author_stage', 'quote_stage', 'tag_stage', 'author', 'quote', 'tag']

In [8]:
author_df.to_sql(name='author_stage', con=engine, if_exists='append', index=False)

In [9]:
quote_df.to_sql(name='quote_stage', con=engine, if_exists='append', index=False)

In [10]:
tag_df.to_sql(name='tag_stage', con=engine, if_exists='append', index=False)